results/smoke/smoke-retrieve-apikey/26052025010744/test_output.log
time="2025-05-26T01:07:44Z" level=debug msg="Logger format: TEXT"
time="2025-05-26T01:07:44Z" level=debug msg="k6 version: v0.46.0 (2023-08-14T13:23:26+0000/v0.46.0-0-gcbd9e9ad, go1.20.7, linux/amd64)"

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

time="2025-05-26T01:07:44Z" level=debug msg="Resolving and reading test 'scripts/smoke-retrieve-apikey.js'..."
time="2025-05-26T01:07:44Z" level=debug msg=Loading... moduleSpecifier="file:///home/aicube/qube_neural_memory/k6/scripts/smoke-retrieve-apikey.js" originalModuleSpecifier=scripts/smoke-retrieve-apikey.js
time="2025-05-26T01:07:44Z" level=debug msg="'scripts/smoke-retrieve-apikey.js' resolved to 'file:///home/aicube/qube_neural_memory/k6/scripts/smoke-retrieve-apikey.js' and successfully loaded 935 bytes!"
time="2025-05-26T01:07:44Z" level=debug msg="Gathering k6 runtime options..."
time="2025-05-26T01:07:44Z" level=debug msg="Initializing k6 runner for 'scripts/smoke-retrieve-apikey.js' (file:///home/aicube/qube_neural_memory/k6/scripts/smoke-retrieve-apikey.js)..."
time="2025-05-26T01:07:44Z" level=debug msg="Detecting test type for..." test_path="file:///home/aicube/qube_neural_memory/k6/scripts/smoke-retrieve-apikey.js"
time="2025-05-26T01:07:44Z" level=debug msg="Trying to load as a JS test..." test_path="file:///home/aicube/qube_neural_memory/k6/scripts/smoke-retrieve-apikey.js"
time="2025-05-26T01:07:44Z" level=debug msg="Babel: Transformed" t=116.415665ms
time="2025-05-26T01:07:44Z" level=debug msg=Loading... moduleSpecifier="file:///home/aicube/qube_neural_memory/k6/scripts/utils-apikey.js" originalModuleSpecifier=./utils-apikey.js
time="2025-05-26T01:07:44Z" level=debug msg="Babel: Transformed" t=155.165387ms
time="2025-05-26T01:07:44Z" level=debug msg="Runner successfully initialized!"
time="2025-05-26T01:07:44Z" level=debug msg="Parsing CLI flags..."
time="2025-05-26T01:07:44Z" level=debug msg="Consolidating config layers..."
time="2025-05-26T01:07:44Z" level=debug msg="Parsing thresholds and validating config..."
time="2025-05-26T01:07:44Z" level=debug msg="Initializing the execution scheduler..."
time="2025-05-26T01:07:44Z" level=debug msg="Starting 1 outputs..." component=output-manager
time="2025-05-26T01:07:44Z" level=debug msg=Starting... component=metrics-engine-ingester
time="2025-05-26T01:07:44Z" level=debug msg="Started!" component=metrics-engine-ingester
  execution: local
     script: scripts/smoke-retrieve-apikey.js
     output: -

  scenarios: (100.00%) 1 scenario, 1 max VUs, 40s max duration (incl. graceful stop):
           * default: 1 looping VUs for 10s (gracefulStop: 30s)

time="2025-05-26T01:07:44Z" level=debug msg="Trapping interrupt signals so k6 can handle them gracefully..."
time="2025-05-26T01:07:44Z" level=debug msg="Starting the REST API server on localhost:6565"
time="2025-05-26T01:07:44Z" level=debug msg="Starting emission of VUs and VUsMax metrics..."
time="2025-05-26T01:07:44Z" level=debug msg="Start of initialization" executorsCount=1 neededVUs=1 phase=execution-scheduler-init
time="2025-05-26T01:07:44Z" level=debug msg="Initialized VU #1" phase=execution-scheduler-init
time="2025-05-26T01:07:44Z" level=debug msg="Finished initializing needed VUs, start initializing executors..." phase=execution-scheduler-init
time="2025-05-26T01:07:44Z" level=debug msg="Initialized executor default" phase=execution-scheduler-init
time="2025-05-26T01:07:44Z" level=debug msg="Initialization completed" phase=execution-scheduler-init
time="2025-05-26T01:07:44Z" level=debug msg="Start of test run" executorsCount=1 phase=execution-scheduler-run
time="2025-05-26T01:07:44Z" level=debug msg="setup() is not defined or not exported, skipping!"
time="2025-05-26T01:07:44Z" level=debug msg="Start all executors..." phase=execution-scheduler-run
time="2025-05-26T01:07:44Z" level=debug msg="Starting executor" executor=default startTime=0s type=constant-vus
time="2025-05-26T01:07:44Z" level=debug msg="Starting executor run..." duration=10s executor=constant-vus scenario=default type=constant-vus vus=1

running (01.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 1 VUs  01.0s/10s
time="2025-05-26T01:07:46Z" level=debug msg="Running thresholds on 2 metrics..." component=metrics-engine
time="2025-05-26T01:07:46Z" level=debug msg="Thresholds on 1 metrics crossed: [http_req_failed]" component=metrics-engine

running (02.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
default   [  20% ] 1 VUs  02.0s/10s

running (03.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
default   [  30% ] 1 VUs  03.0s/10s
time="2025-05-26T01:07:48Z" level=debug msg="Running thresholds on 2 metrics..." component=metrics-engine
time="2025-05-26T01:07:48Z" level=debug msg="Thresholds on 1 metrics crossed: [http_req_failed]" component=metrics-engine

running (04.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
default   [  40% ] 1 VUs  04.0s/10s

running (05.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
default   [  50% ] 1 VUs  05.0s/10s
time="2025-05-26T01:07:50Z" level=debug msg="Running thresholds on 2 metrics..." component=metrics-engine
time="2025-05-26T01:07:50Z" level=debug msg="Thresholds on 1 metrics crossed: [http_req_failed]" component=metrics-engine

running (06.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
default   [  60% ] 1 VUs  06.0s/10s

running (07.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
default   [  70% ] 1 VUs  07.0s/10s
time="2025-05-26T01:07:52Z" level=debug msg="Running thresholds on 2 metrics..." component=metrics-engine
time="2025-05-26T01:07:52Z" level=debug msg="Thresholds on 1 metrics crossed: [http_req_failed]" component=metrics-engine

running (08.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
default   [  80% ] 1 VUs  08.0s/10s

running (09.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
default   [  90% ] 1 VUs  09.0s/10s

running (10.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
default   [ 100% ] 1 VUs  10.0s/10s
time="2025-05-26T01:07:54Z" level=debug msg="Running thresholds on 2 metrics..." component=metrics-engine
time="2025-05-26T01:07:54Z" level=debug msg="Thresholds on 1 metrics crossed: [http_req_failed]" component=metrics-engine
time="2025-05-26T01:07:54Z" level=debug msg="Regular duration is done, waiting for iterations to gracefully finish" executor=constant-vus gracefulStop=30s scenario=default

running (11.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
default ↓ [ 100% ] 1 VUs  10s
time="2025-05-26T01:07:55Z" level=debug msg="Executor finished successfully" executor=default startTime=0s type=constant-vus
time="2025-05-26T01:07:55Z" level=debug msg="teardown() is not defined or not exported, skipping!"
time="2025-05-26T01:07:55Z" level=debug msg="Test finished cleanly"
time="2025-05-26T01:07:55Z" level=debug msg="Stopping vus and vux_max metrics emission..." phase=execution-scheduler-init
time="2025-05-26T01:07:55Z" level=debug msg="Metrics emission of VUs and VUsMax metrics stopped"
time="2025-05-26T01:07:55Z" level=debug msg="Releasing signal trap..."
time="2025-05-26T01:07:55Z" level=debug msg="Sending usage report..."
time="2025-05-26T01:07:55Z" level=debug msg="Waiting for metric processing to finish..."
time="2025-05-26T01:07:55Z" level=debug msg="Metrics processing finished!"
time="2025-05-26T01:07:55Z" level=debug msg="Finalizing thresholds..."
time="2025-05-26T01:07:55Z" level=debug msg=Stopping... component=metrics-engine-ingester
time="2025-05-26T01:07:55Z" level=debug msg="Stopped!" component=metrics-engine-ingester
time="2025-05-26T01:07:55Z" level=debug msg="Running thresholds on 2 metrics..." component=metrics-engine
time="2025-05-26T01:07:55Z" level=debug msg="Thresholds on 1 metrics crossed: [http_req_failed]" component=metrics-engine
time="2025-05-26T01:07:55Z" level=debug msg="Stopping outputs..."
time="2025-05-26T01:07:55Z" level=debug msg="Stopping 1 outputs..." component=output-manager
time="2025-05-26T01:07:55Z" level=debug msg=Stopping... component=metrics-engine-ingester
time="2025-05-26T01:07:55Z" level=debug msg="Stopped!" component=metrics-engine-ingester
time="2025-05-26T01:07:55Z" level=debug msg="Generating the end-of-test summary..."

     ✗ Status is correct
      ↳  0% — ✓ 0 / ✗ 10

     checks.....................: 0.00%   ✓ 0        ✗ 10 
     data_received..............: 2.4 kB  216 B/s
     data_sent..................: 3.2 kB  292 B/s
     http_req_blocked...........: avg=8.98ms  min=3.8µs   med=6.75µs  max=89.82ms  p(90)=8.99ms   p(95)=49.4ms  
     http_req_connecting........: avg=8.97ms  min=0s      med=0s      max=89.74ms  p(90)=8.97ms   p(95)=49.35ms 
   ✓ http_req_duration..........: avg=98.06ms min=97.66ms med=97.72ms max=100.97ms p(90)=98.27ms  p(95)=99.62ms 
   ✗ http_req_failed............: 100.00% ✓ 10       ✗ 0  
     http_req_receiving.........: avg=82.32µs min=57µs    med=77.44µs max=120.3µs  p(90)=110.22µs p(95)=115.26µs
     http_req_sending...........: avg=49.07µs min=26µs    med=43.65µs max=118.8µs  p(90)=65.88µs  p(95)=92.34µs 
     http_req_tls_handshaking...: avg=0s      min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...........: avg=97.93ms min=97.55ms med=97.6ms  max=100.75ms p(90)=98.09ms  p(95)=99.42ms 
     http_reqs..................: 10      0.902528/s
     iteration_duration.........: avg=1.1s    min=1.09s   med=1.09s   max=1.19s    p(90)=1.1s     p(95)=1.15s   
     iterations.................: 10      0.902528/s
     vus........................: 1       min=1      max=1
     vus_max....................: 1       min=1      max=1


running (11.1s), 0/1 VUs, 10 complete and 0 interrupted iterations
default ✓ [ 100% ] 1 VUs  10s
time="2025-05-26T01:07:56Z" level=debug msg="Usage report sent successfully"
time="2025-05-26T01:07:56Z" level=debug msg="Everything has finished, exiting k6 with an error!" error="thresholds on metrics 'http_req_failed' have been crossed"
time="2025-05-26T01:07:56Z" level=error msg="thresholds on metrics 'http_req_failed' have been crossed"